{
  "1": {
    "week": 1,
    "day": 1,
    "weekTitle": "Introduction",
    "dayTitle": "Sanctification (To Be Set Apart)",
    "daySubTitle": null,
    "devotionText": "My brother, to sanctify is to be set apart as holy. Saul had to be called out into the open by Samuel to be set apart for God.  Our Lord Jesus Christ called Simon and Andrew from the boat and set them apart for himself in service of His kingdom. Moses was called by his curiosity of the burning bush to be set apart for God.   If you are reading this and have begun this journey to sexual obedience, then you too, like me, have been called and set apart by God.  This is the beginning of the sanctification process. Welcome!  Like Saul, Simon and Andrew, and Moses, this is the beginning of the journey to be set apart and used by God in the way that He designed you.",
    "reflectionQuestion": "What do you think you could achieve with sexual obedience that would be impossible to do so without it?",
    "Scriptures": {
      "1": {
        "book": "Romans",
        "chapter": 1,
        "verse": "1",
        "translation": "CSB",
        "text": "Paul, a servant of Christ Jesus, called as an apostle and set apart for the gospel of God."
      },
      "2": {
        "book": "Acts",
        "chapter": 13,
        "verse": "2",
        "translation": "CSB",
        "text": "As they were worshipping the Lord and fasting, the Holy Spirit said, \"Set apart for me Barnabas and Saul for the work to which I have called them.\""
      },
      "3": {
        "book": "1 Corinthians",
        "chapter": 1,
        "verse": "2",
        "translation": "CSB",
        "text": "To the church of God at Corinth, to those sanctified in Christ Jesus, called as saints, with all those in every place who call on the name of Jesus Christ our Lord—both their Lord and ours."
      }
    }
  },
  "2": {
    "week": 1,
    "day": 2,
    "weekTitle": "Introduction",
    "dayTitle": "Singles/Married to Christ",
    "daySubTitle": null,
    "devotionText": "My brother, you probably heard this verse before.  Who hasn’t?  Find a good spouse, you find a good life.  What else is there to say?  If you find a wife as described in Proverbs 31, and you yourself have submitted to our God and Father, then a good life you will certainly find.  But that is not all…\n\nThe AND statement is the key!  If you find a good spouse, you will also find more.  What more?  The favor of God. You mean God favors those men who decide to marry?!?  Yes!  He certainly does.  I tell men all the time that God speaks to you differently in marriage then when you are not married.  God blesses this institution when it operates under his perfect law of liberty.  The marriage itself provides a good life, but what you did not anticipate is that God also favors it.  This means that he does everything in His power to bless you under this institution.  Isn’t that great news for those who seek and find marriage?  This is great news indeed!\n\n And Jesus Christ ultimately is that good thing that shows up in your marriage.",
    "reflectionQuestion": "How do you interpret this verse?  Why do you think God favors you in marriage?",
    "Scriptures": {
      "1": {
        "book": "Proverbs",
        "chapter": 18,
        "verse": "22",
        "translation": "NKJV",
        "text": "He who finds a wife finds a good thing, And obtains favor from the LORD."
      }
    }
  },
  "3": {
    "week": 1,
    "day": 3,
    "weekTitle": "Introduction",
    "dayTitle": "Your Spouse is the Savior of Your Body",
    "daySubTitle": "Avoid sin.  Your spouse is the savior of your body.  (Embrace your marriage/Get married)",
    "devotionText": "Look brother!  You have two options to live in the will of God.  The first option is to be like Paul.  Paul is suggesting full submission to Christ--all your mind, body, heart and strength.  This includes forgoing a marital relationship.  Paul stated that he wished all people were like he was, and acknowledged that he was gifted to be this way.  The only other man in the Bible that had the same gifting to live unencumbered without a wife was our Lord and Savior Jesus Christ.  Even Peter the rock that the church would be built on was married!  The second option is to get married.  Submit your body to your wife and let your wife submit her body to you.  Paul states that we do so because of our lack of self control and so Satan will not tempt us with sexual sin.  Think about this choice today.  The only other options include a broad swath of choices that all lead down the road to sexual disobedience.  Paul is not saying that it is easy.  He is saying that the choice is one of necessity.",
    "reflectionQuestion": "Think about Paul’s words today.   Paul did not make the command for sexual obedience.  God did.  Paul is only repackaging that prudent solution of marriage, but only as a concession.  How do you interpret Paul’s words?",
    "Scriptures": {
      "1": {
        "book": "1 Corinthians",
        "chapter": 7,
        "verse": "1-7",
        "translation": "AMP",
        "text": "Now as to the matters of which you wrote: It is good (beneficial, advantageous) for a man not to touch a woman [outside marriage]. But because of [the temptation to participate in] sexual immorality, let each man have his own wife, and let each woman have her own husband. The husband must fulfill his [marital] duty to his wife [with good will and kindness], and likewise the wife to her husband. The wife does not have [exclusive] authority over her own body, but the husband shares with her; and likewise the husband does not have [exclusive] authority over his body, but the wife shares with him. Do not deprive each other [of marital rights], except perhaps by mutual consent for a time, so that you may devote yourselves [unhindered] to prayer, but come together again so that Satan will not tempt you [to sin] because of your lack of self-control. But I am saying this as a concession, not as a command. I wish that all the people were as I am; but each person has his own gift from God, one of this kind and one of that."
      }
    }
  },
  "4": {
    "week": 1,
    "day": 4,
    "weekTitle": "Introduction",
    "dayTitle": "Marriage",
    "daySubTitle": null,
    "devotionText": "My brother, are you still considering the important need for marriage. We know that God created Eve after he saw that Adam was alone. Adam also knew that he was alone. During Adam’s task to name all the animals, Adam saw the animals were made in pairs. He already knew what male and female were.  He could tell he had no counterpart. When God presented Eve to Adam, Adam cried out “this is flesh of my flesh and bone of my bone”. He immediately knew that this woman was his counterpart.\n In today’s chapter, through Malachi, God tells us the purpose of marriage but not until he reconfirms that it was HE that made marriage in the first place.  Man did not make marriage no matter the myriad of ways we choose to prepare the wedding ceremony.  So if God made marriage, is it not His right to also tell us the purpose of the marriage?!?  Malachi writes clearly that the purpose of marriage is to bring forth children of God or holy seeds.  In other words, marriage is meant for not only procreation so that the human race can continue on, but it is also meant to raise and establish children that know and follow God!  Marriage was not created for your own personal happiness.  It can provide that too, but God has a bigger plan in mind.  And if you return to the story of the first sin, you may also remember that it is the holy seed that will eventually crush the head of Satan.\n But don’t miss the first part of the passage that hearkens back to 1 Peter 3:7 which says that if you do not treat your wife with honor, that God will not hear your prayers.",
    "reflectionQuestion": "Have you ever given thought about the purpose of marriage from God’s perspective?",
    "Scriptures": {
      "1": {
        "book": "Malachi",
        "chapter": 2,
        "verse": "13-15",
        "translation": "MSG",
        "text": "And here’s a second offense: You fill the place of worship with your whining and sniveling because you don’t get what you want from God. Do you know why? Simple. Because God was there as a witness when you spoke your marriage vows to your young bride, and now you’ve broken those vows, broken the faith-bond with your vowed companion, your covenant wife. God, not you, made marriage. His Spirit inhabits even the smallest details of marriage. And what does he want from marriage? Children of God, that’s what. So guard the spirit of marriage within you. Don’t cheat on your spouse."
      }
    }
  },
  "5": {
    "week": 1,
    "day": 5,
    "weekTitle": "Introduction",
    "dayTitle": "Rely on Your Wife for Your Sexual Needs",
    "daySubTitle": null,
    "devotionText": "My brother, I am going to challenge you on this one.  You thought that when you got married that every sexual need that you could ever have imagined would be right at your fingertips day and night.  You thought that you would never have to chase sex again.  You have a beautiful wife, so your days of finding ways to meet your sexual needs are now long over.\nWhat you didn’t realize is that your wife is a thinking, breathing, human being that has needs and wants too.  She has to be happy and cared for and taken care of and… and… and… to be available for you to have sex with.  Now you are realizing that this marriage thing to meet your sexual needs is not what it was cracked up to be.  Why didn’t someone tell you this before you entered this union?\nMy brother, don’t worry, this is bigger than you.  This is my challenge.  Make up your mind to meet all of your sexual needs through your wife.  Period.  No if ands or buts.  Just do it.  This will change everything.  Your wife is upset and you would rather sneak a few minutes of pornography in the bathroom.  Nope!  Turn back around and make it right.  Another woman is showing you the respect that you feel you deserve, so maybe if I make her my wife for the night. Nope!  Turn around and have a conversation with your covenant wife.  You can’t bother to meet her needs tonight.  You just want to get off quick and go to sleep.  Maybe I can think about a sexual experience with another woman from my past and get off.  Nope!  Get back to reality and get that need met through your wife.\nIf you are married, your first step to fully connecting to God is to fully connect with your wife.  There is no way around it.  Your wife is the entryway to developing your relationship with your heavenly father.  Trust me on this: This step is a necessity during this journey to sexual obedience.  It starts here but it doesn’t end here.",
    "reflectionQuestion": "Think about this challenge.  Can you commit to do it for the next 4 weeks on this Clean journey?  This is the sacrifice that I am asking of you.  For those brothers that are not yet married, you are married to Christ until you find a saviour for your body.  If you are not married and haven’t had sex before, you are blessed.  I commend you.  If you are single and have had sex before, you can do it.  Let the Lord be with you these next few weeks.  Submit your heart, soul, mind and strength to our God and Father, He will sustain you.",
    "Scriptures": {
      "1": {
        "book": "Proverbs",
        "chapter": 5,
        "verse": "17-20",
        "translation": "MSG",
        "text": "Enjoy the wife you married as a young man!  Lovely as an angel, beautiful as a rose—don’t ever quit taking delight in her body.  Never take her love for granted!  Why would you trade enduring intimacies for cheap thrills with a whore? For dalliance with a promiscuous stranger?"
      }
    }
  },
  "6": {
    "week": 1,
    "day": 6,
    "weekTitle": "Introduction",
    "dayTitle": "The Flesh vs The Spirit",
    "daySubTitle": null,
    "devotionText": "My brother, I gave you a big challenge yesterday!  Let me now tell you more about the battle that you are engaged in.  And really this is the ultimate versus battle for every man born in the flesh.  This battle is one of the flesh against the Spirit.  These two entities are literally complete opposites in every way.   And honestly they can’t occupy the same space at the same time.  If you are feeding one, you are in turn starving the other.  It is as simple as that.\nThis is what you have to understand today.  You have to be aware of which of these two you are feeding.  In your daily activity, are you feeding the flesh or are you feeding the Spirit?  On the one hand, reread the works of the flesh as described by Paul: adultery, fornication, uncleanness, lewdness, idolatry, sorcery, hatred, contentions, jealousies, outbursts of wrath, selfish ambitions, dissensions, heresies, envy, murders, drunkenness, reveleries.  Think about your daily being and reflect on these works.  Christ said that you can know the tree by the fruit that it produces.   The works of the flesh are all selfish in nature.\nOn the other hand, the fruit of the Spirit is love, joy, peace, longsuffering, kindness, goodness, faithfulness, gentleness, self-control.   Did you notice that Paul described the works of the flesh in the plural, but the fruit of the spirit in singular?  The fruit of the spirit is like a multifaceted diamond.  This is the single character of the Spirit which can shine in different ways depending on where the light is reflected, but the whole still remains the same.  In other words, the fruit of the mango can be juicy, rich and sweet in the same bite.  So the fruit of the Spirit can have all these characteristics at the same time.\nTo win this battle against flesh, you have to at the very least feed the Spirit more than the flesh.  Most Christians feed the Spirit for 1-hour per week in Church but the other 167-hours in the week, they feed the flesh. This won’t work in this fight for sexual obedience.  I hear you asking yourself: how do you feed the Spirit?  You feed the Spirit through reading the Word of God, prayer, fasting. You feed the Spirit through praise and worship. You feed the spirit by loving God and loving your neighbor.  The fruit of the Spirit is ultimately found full through your selflessness.",
    "reflectionQuestion": "Think about your typical week, which are you feeding more--the flesh or the Spirit? In what ways can you give the Spirit the advantage?",
    "Scriptures": {
      "1": {
        "book": "Galatians",
        "chapter": 5,
        "verse": "17-24",
        "translation": "NKJV",
        "text": "For the flesh lusts against the Spirit, and the Spirit against the flesh; and these are contrary to one another, so that you do not do the things that you wish. But if you are led by the Spirit, you are not under the law.\nNow the works of the flesh are evident, which are: adultery, fornication, uncleanness, lewdness, idolatry, sorcery, hatred, contentions, jealousies, outbursts of wrath, selfish ambitions, dissensions, heresies, envy, murders, drunkenness, revelries, and the like; of which I tell you beforehand, just as I also told you in time past, that those who practice such things will not inherit the kingdom of God.\nBut the fruit of the Spirit is love, joy, peace, longsuffering, kindness, goodness, faithfulness, gentleness, self-control. Against such there is no law. And those who are Christ’s have crucified the flesh with its passions and desires. If we live in the Spirit, let us also walk in the Spirit."
      }
    }
  },
  "7": {
    "week": 1,
    "day": 7,
    "weekTitle": "Introduction",
    "dayTitle": "Fight One Day at a Time",
    "daySubTitle": null,
    "devotionText": "My brother, tough week right?!?!   I am well aware.  Remember, I went through the same journey that you are now embarking.  I am writing this from my personal experience and based on the men that have walked down this same narrow road.   I know exactly what you are going through.  You think that I am asking more of you than you think you can give.  And you are right, I am.\nOne thing that I realized in this fight is that it is all about intent.  You actually do not have to win the fight yourself.  God does not expect you to win.  In fact, He knows that you cannot win the fight against sin through your own will power.  Does this sound familiar?  Is this not why God sent His only begotten Son to set us free because He knew that we would need a saviour?  When I took the baton as far as could--through reading the Word, praying and fasting--God met me where I was on that track and took the baton and finished the race.  And boy did I need it.  When I had the baton, I told myself the same thing EVERY SINGLE DAY: Do not worry about tomorrow.  Worry about the fight today, tonight, this moment.  Win right now!  You might fall tomorrow.  Just do not fall now no matter what.  If you fall tomorrow, so be it.  But under no circumstance do you fall at this moment.  Just fight one day at a time.  Can you give me another moment, evening, day?  Do not get ahead of yourself.  Do not count the days.  Just live your life for our God and fight!  Like me, pray and know for certain that God will meet you where you are when you have done everything that you can in your own power.  God only needs you to choose Him. He cannot do that for you.",
    "reflectionQuestion": "Can you take on this mentality and fight for sexual obedience one day at a time?  Do you believe that God will finish the race for you?",
    "Scriptures": {
      "1": {
        "book": "Matthew",
        "chapter": 6,
        "verse": "34",
        "translation": "NIV",
        "text": "Therefore do not worry about tomorrow, for tomorrow will worry about itself. Each day has enough trouble of its own."
      }
    }
  },
  "8": {
    "week": 2,
    "day": 1,
    "weekTitle": "Soul Ties",
    "dayTitle": "Healthy Bonding",
    "daySubTitle": null,
    "devotionText": "My brother, in the beginning God created male and female.  If you are familiar with the book of Genesis chapter 2 verse 24, the inspired writer of the book Moses, after Adam meets Eve for the first time, comments, “Therefore a man shall leave his father and mother and be joined to his wife, and they shall become one flesh.”  This is obviously a commentary from the writer because neither Adam nor Eve had a fleshly father or mother since they were the first human beings created by God.  However, Moses pointed out that man and woman were meant to become united as one flesh.  And Jesus reverberated these words in the Book of Matthew in today’s scripture in answering the Pharisees question about divorce..\nThe physical act of sexual intercourse is the uniting of male and female.  In other words, sexual intercourse is marriage under God’s law. It is a blood covenant. The first sexual act for a woman breaks the hymen and this breaking releases blood signifying marriage between man and woman. The man, at the time of Abraham, had to be circumcised which also caused the shedding of blood as a symbol of his covenant or marriage to God. This blood covenant is not to be broken once male and female have been joined together.  Marriage is a covenant institution, and that covenant is established through sexual intercourse.  (If you explore further, the breaking of this covenant can only happen when one partner has sex with another person outside of marriage through sexual immoratlity committing adultery. Sex can be both part of the joining together and the separation of a marriage.)\nSimply put, sex is the basis of marriage, and is the singular, healthy way man and woman are to be united. This is how the lives of male and female are knit together.  And because it is under God, this bond is spiritual, as much as it is physical.The one flesh is a coming together of mind, body and soul.  Many refer to marriage as a holy covenant when done according to God’s law. Colloquially, some also call it a soul tie.",
    "reflectionQuestion": "Do you understand God’s design for marriage through the holy covenant of male and female?",
    "Scriptures": {
      "1": {
        "book": "Matthew",
        "chapter": 19,
        "verse": "4-6",
        "translation": "NIV",
        "text": "Haven’t you read,” he replied, “that at the beginning the Creator ’made them male and female,’ and said, ’For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh’? So they are no longer two, but one flesh. Therefore what God has joined together, let no one separate."
      }
    }
  },
  "9": {
    "week": 2,
    "day": 2,
    "weekTitle": "Soul Ties",
    "dayTitle": "Unhealthy Bonding",
    "daySubTitle": null,
    "devotionText": "My brother, so now you are thinking, I am not a virgin and I am not married, so I definitely missed this whole healthy bonding thing yesterday!  Actually, I am not a virgin many times over.  Paul says since our bodies are owned by Christ that we should never unite those bodies with a prostitute.  In this case, a prostitute refers to someone that is not our wife.  But Paul further states that if we do unite our body with a prostitute that we become one flesh with that prostitute.  Paul makes it clear that the principle of bonding between male and female happens when sexual intercourse occurs.  And he makes it plain that we cannot choose who we become one body with when sex is involved.  When we choose sex, we also as a consequence, whether intended or not, become bonded with that partner.  Becoming one flesh with different women through sex is sexual immorality.  And every woman that we have sex also creates a bond with that woman.  This is the case whether it is a girlfriend from our past that we had a long relationship with to a one night stand after a party, or literally a paid encounter with a prostitute.  These covenants that we made where the intention was not marriage, but our own pleasure are called unholy covenants and represent unhealthy bonding. And it is these types of covenants that open the door to the enemy.\nThese bonds can easily be validated in the mind.  Have you ever been out somewhere familiar and that place triggered a memory of a woman that you have been with sexually in the past?  Or has a sexual event from your past appeared to your mind visually out of nowhere?  Or have you ever had a dream where you were taken back to a moment with a woman from your past or a woman that you have lusted after?",
    "reflectionQuestion": "Have you experienced unhealthy bonding in your life?  Do you still sense a connection between these previous partners?  How has that connection shown up in your life since separating from that partner?",
    "Scriptures": {
      "1": {
        "book": "1 Corinthians",
        "chapter": 6,
        "verse": "12-20",
        "translation": "NIV",
        "text": "\"I have the right to do anything,\" you say—but not everything is beneficial. \"I have the right to do anything\"—but I will not be mastered by anything. You say, \"Food for the stomach and the stomach for food, and God will destroy them both.\" The body, however, is not meant for sexual immorality but for the Lord, and the Lord for the body.\nBy his power God raised the Lord from the dead, and he will raise us also. Do you not know that your bodies are members of Christ himself? Shall I then take the members of Christ and unite them with a prostitute? Never! Do you not know that he who unites himself with a prostitute is one with her in body? For it is said, \"The two will become one flesh.\" But whoever is united with the Lord is one with him in spirit. Flee from sexual immorality. All other sins a person commits are outside the body, but whoever sins sexually, sins against their own body. Do you not know that your bodies are temples of the Holy Spirit, who is in you, whom you have received from God? You are not your own; you were bought at a price. Therefore honor God with your bodies."
      }
    }
  },
  "10": {
    "week": 2,
    "day": 3,
    "weekTitle": "Soul Ties",
    "dayTitle": "Spiritual Act of Worship",
    "daySubTitle": null,
    "devotionText": "My brother, your sex life is a spiritual form of worship to God.  Up until this point, you were applauded for the number of women that you had sex with.  We were wrong.  I realized that every woman that I had sex with actually put distance between me and God.  Actually God is the immovable object, but we, ourselves, pull farther away.  Do you want to really draw closer to God?  An important part of that directional move is to offer your body as a living sacrifice to Him.  Submit your members (your penis) to Him, and use it only under the parameters that he deemed holy and pleasing to Him.\nLet’s also broaden the idea of sex by using a snippet from Jesus’ Sermon on the Mount which preached, “You have heard that it was said to those of old, ‘You shall not commit adultery.’  But I say to you that whoever looks at a woman to lust for her has already committed adultery with her in his heart. ” (Matthew 5:27-28 NKJV).  Furthermore, Job 31:1-4 (MSG) says, “I made a solemn pact with myself never to undress a girl with my eyes. So what can I expect from God? What do I deserve from God Almighty above?  Isn’t calamity reserved for the wicked? Isn’t disaster supposed to strike those who do wrong? Isn’t God looking, observing how I live? Doesn’t he mark every step I take?” Both make it clear that while the sin is full grown under the act of fornication or adultery, sexual sin is first conceived at the point of lust.  Ask David what happened when he saw Bathsheba bathing on that rooftop! To be thorough, I want you to conclude that everything from lust of the eyes to the physical act of sexual intercourse, and every sexual encounter that falls short of intercourse should be included in unhealthy bonding.  This includes but is not limited to lusting after a woman that you could not have sex with, receiving or giving oral sex, engaging in pornography, frequenting strip clubs, being molested, having sex with a woman whose name that you cannot remember, and having sex with women whose names you can remember.\nOne topic that comes up consistently is to or not to masturbate.  Let me add this for those who need an extra push.  You are right, the topic of masturbation cannot be found anywhere in the Bible.  The closest we have is the Onan, the son of Judah, spilling his seed on the ground because he did not want to have children with Tamar.  Because of this lack of mention of masturbation as sin in the Bible, some men have argued that it is ok to masturbate.  So let us say that you are able to masturbate without the help of a physical interaction with a woman that is not your wife, without the help of pornography, or without the help of fantasizing about a woman, have you ever been able to masturbate and pray to your God thereafter? No.  And that is because masturbation alone brings shame and causes you to hide from God.  Anything that causes you to turn from God in your life should be avoided.",
    "reflectionQuestion": "What would it mean for you to submit your body as a living sacrifice to God?",
    "Scriptures": {
      "1": {
        "book": "Romans",
        "chapter": 12,
        "verse": "1",
        "translation": "NKJV",
        "text": "Therefore, I urge you brothers, in view of God's mercy, to offer your bodies as living sacrifices, holy and pleasing to God -- this is your spiritual act of worship"
      }
    }
  },
  "11": {
    "week": 2,
    "day": 4,
    "weekTitle": "Soul Ties",
    "dayTitle": "Soul Tie Assignment",
    "daySubTitle": null,
    "devotionText": "Make a list, for yourself, of every woman that you had sex with outside of marriage.  Use the safe broad definition that we discussed yesterday.  Pray and ask the Holy Spirit to reveal to you the names and faces of these women.  Make note of women who are not your wife that come to memory and under what circumstance.\nFor the list, Initials are fine.  No title is fine.  If you can’t remember the name, make a note of the event or whatever placeholder that makes sense.  This list is for you, but it will be something that we will use for tomorrow’s devotional.\nAnd make note of all the activity in your dreams this week.\nIf you have concerns, take a peak at Week 2, Day 5 now.  The purpose is to pray to break the soul tie that you have with these past women under the blood of our saviour and king Jesus Christ.",
    "reflectionQuestion": null,
    "Scriptures": null
  },
  "12": {
    "week": 2,
    "day": 5,
    "weekTitle": "Soul Ties",
    "dayTitle": "Soul Ties Prayer",
    "daySubTitle": null,
    "devotionText": "We are going to stand on the promise of our Lord Jesus Christ, His cleansing blood and His renewing spirit.\nFor each one of the names that are on your list and those that the Holy Spirit has not yet brought to your remembrance, you will pray the following to break the unholy covenants and soul ties of your past.\n\nBREAKING SOUL TIES PRAYER\nLord God, I repent for my sin with _____.  Please forgive me God.  I renounce the relationship before you.  Please break any soul ties I may have with _______ in the name of Jesus Christ.  I release her in your Holy name.\nPlease bring to my remembrance any and everyone that I need to break soul ties with.  LORD God I wish to be free for my covenant wife.  *REPEAT\n\nEXAMPLE\nLord God, I repent for my sin with Jessica.  Please forgive me God.  I renounce the relationship before you.  Please break any soul ties I may have with Jessica in the name of Jesus Christ.  I release her in your Holy name.\nPlease bring to my remembrance any and everyone that I need to break soul ties with.  LORD God I wish to be free for my covenant wife.  *REPEAT\n\nIt seems so simple.  I get it.  The gift of Jesus Christ is simple and attainable by all who believe.  You have already said that you believe in Him before we started this Clean journey.  Stand on His promise in his Holy Name.  He can and will free you from your past.  Stand on it.  Pray and release your past so you can get out of the land of Egypt and/or the wilderness and into your Promised Land.\nBut wait, these prayers will really free you from the past.  These past memories will begin to dissipate from your mind.  Your escapes into these fantasies will be harder to get to and in some cases will be completely gone from your memory.  Are you ready for that leap?  If you marry, your wife is all that you will be able to rely on for your sexual needs.  This is the way that God designed it.\nFinally, this prayer is short so you can do it anywhere and everywhere.  When fantasies of other women come into your mind, you should break that soul tie immediately.  Don’t wait.  Do it on the spot.  Capture the thought and cast it down immediately.",
    "reflectionQuestion": "Do what you can today, but this will be a continual process during Clean and beyond Clean.",
    "Scriptures": {
      "1": {
        "book": "John",
        "chapter": 15,
        "verse": "17",
        "translation": "NIV",
        "text": "If you remain in me and my words remain in you, ask whatever you wish, and it will be done for you."
      }
    }
  },
  "13": {
    "week": 2,
    "day": 6,
    "weekTitle": "Soul Ties",
    "dayTitle": "Sexual Temptation in Dreams",
    "daySubTitle": null,
    "devotionText": "My brother, how is the assignment going?  Keep going.  Continue to ask the Holy Spirit to reveal those soul ties that you may have missed.  Be obedient and break those soul ties as they come to your remembrance.  Do not relish in the past, just release it in Jesus’ name.\nOne thing that I have experienced personally and have heard through the testimonies of many of the brothers like you who have moved through the Clean process is attacks in the dream state.  You may have already experienced this prior to Clean.  While sleeping, you may experience a dream where you are offered sex or find yourself in a sexually compromising situation.  Young boys colloquially called these wet dreams.  They are similar, but in order to clear up the misunderstanding around these types of dreams, let me explain.  This temptation is not from God.  These dreams are demonic attacks from the enemy and one must resist them.  I know, this is weird, and this might be the first time you are hearing about something like this.  I get it.  But listen.  Through the breaking of soul ties, you are cleaning up your past through the cleansing blood of our Lord and Saviour Jesus Christ.  And this act in and of itself is going to alert the enemy.  You were complicit in sexual disobedience, and the enemy is trying to make sure that he doesn’t lose one of his best members.\nThe key is that the fight against sexual disobedience must not only happen in the physical realm, but all seeds must be killed at the conception stage wherever they appear, including the dream state.  You have to fight the enemy on all levels.  If you are faced with a sexual proposition in your dream, you say no!  You resist, You run.  You get out of there.  And if worse comes to worse and you find yourself succumbing to the proposition then you WAKE UP!  There is no shame in that.  And even if you do fall during the dream, you pray, you repent, and you fight again the next time.  Don’t give up!    And finally, if you experience sleep paralysis or torment or any other demonic attack, you cry out--whether audibly or inaudibly--the name Jesus Christ.  The name above every name will set you free.\nAnd remember “No temptation has overtaken you except such as is common to man; but God is faithful, who will not allow you to be tempted beyond what you are able, but with the temptation will also make the way of escape, that you may be able to bear it.” (1 Corinthians 10:13)",
    "reflectionQuestion": " Have you had sexual dreams in the past?  How do you act in that dream?  If you have a sexual dream during this process, make a note of it and share the dream and your response with the group.",
    "Scriptures": {
      "1": {
        "book": "James",
        "chapter": 1,
        "verse": "12-15",
        "translation": "NKJV",
        "text": "Blessed is the man who endures tempation; for when he has been approved, he will receive the crown of life which the Lord has promised to those who love Him. Let no one say when he is tempted, \"I am tempted by God\"; for God cannot be tempted by evil, nor does He Himself tempt anyone. But each one is tempted when he is drawn away by his own desires and enticed. Then, when desire has conceived, it gives birth to sin; and sin, when it is full-grown, brings forth death."
      }
    }
  }
}
